### TF Part # 1
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```

  [command]/home/runner/work/_temp/a6ac15cc-660c-4f28-b9be-5ff5fa3ad672/terraform-bin show -no-color tf.plan
2023-08-08T14:08:45.294Z [INFO]  Terraform version: 1.5.4
2023-08-08T14:08:45.295Z [INFO]  Go runtime version: go1.20
2023-08-08T14:08:45.296Z [INFO]  CLI args: []string{"/home/runner/work/_temp/a6ac15cc-660c-4f28-b9be-5ff5fa3ad672/terraform-bin", "show", "-no-color", "tf.plan"}
2023-08-08T14:08:45.296Z [INFO]  CLI command args: []string{"show", "-no-color", "tf.plan"}
2023-08-08T14:08:45.574Z [INFO]  provider: configuring client automatic mTLS
2023-08-08T14:08:45.672Z [INFO]  provider.terraform-provider-google_v4.73.0_x5: configuring server automatic mTLS: timestamp=2023-08-08T14:08:45.672Z

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.default-allow-icmp will be created
  + resource "google_compute_firewall" "default-allow-icmp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "default-allow-icmp"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_tags        = [
          + "web",
        ]

      + allow {
          + ports    = [
              + "80",
              + "8080",
              + "1000-2000",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_network.default will be created
  + resource "google_compute_network" "default" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "default"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = "advizir-dev"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_compute_firewall.default-allow-icmp will be created%0A  + resource "google_compute_firewall" "default-allow-icmp" {%0A      + creation_timestamp = (known after apply)%0A      + destination_ranges = (known after apply)%0A      + direction          = (known after apply)%0A      + enable_logging     = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "default-allow-icmp"%0A      + network            = "default"%0A      + priority           = 1000%0A      + project            = (known after apply)%0A      + self_link          = (known after apply)%0A      + source_tags        = [%0A          + "web",%0A        ]%0A%0A      + allow {%0A          + ports    = [%0A              + "80",%0A              + "8080",%0A              + "1000-2000",%0A            ]%0A          + protocol = "tcp"%0A        }%0A      + allow {%0A          + ports    = []%0A          + protocol = "icmp"%0A        }%0A    }%0A%0A  # google_compute_network.default will be created%0A  + resource "google_compute_network" "default" {%0A      + auto_create_subnetworks                   = true%0A      + delete_default_routes_on_create           = false%0A      + gateway_ipv4                              = (known after apply)%0A      + id                                        = (known after apply)%0A      + internal_ipv6_range                       = (known after apply)%0A      + mtu                                       = (known after apply)%0A      + name                                      = "default"%0A      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      + project                                   = "advizir-dev"%0A      + routing_mode                              = (known after apply)%0A      + self_link                                 = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 2023-08-08T14:08:45.294Z [INFO]  Terraform version: 1.5.4%0A2023-08-08T14:08:45.295Z [INFO]  Go runtime version: go1.20%0A2023-08-08T14:08:45.296Z [INFO]  CLI args: []string{"/home/runner/work/_temp/a6ac15cc-660c-4f28-b9be-5ff5fa3ad672/terraform-bin", "show", "-no-color", "tf.plan"}%0A2023-08-08T14:08:45.296Z [INFO]  CLI command args: []string{"show", "-no-color", "tf.plan"}%0A2023-08-08T14:08:45.574Z [INFO]  provider: configuring client automatic mTLS%0A2023-08-08T14:08:45.672Z [INFO]  provider.terraform-provider-google_v4.73.0_x5: configuring server automatic mTLS: timestamp=2023-08-08T14:08:45.672Z%0A
::debug::exitcode: 0

  ```

  </details>

  *Pusher: @misrarm, Action: `pull_request`, Workflow: `[TF] Applying Infra Changes`*